;===========================================================================
;   RUSTY DETAILED SOLDIER LISTS LOCALISATION
;   CREATED 14/07/22 00:30  UPDATED 18/07/22 01:30
;===========================================================================
[X2EventListener_StatusOfDSLRusty]
strOfficerAlreadySelectedStatus="指挥官已在队"
strCommandingOfficer = "指挥官单位"
 
strSPARKAlreadySelectedStatus="SPARK已在队"
strSPARKUnit = "SPARK单位"
 
;===========================================================================
 
[MoreDetailsManager]
m_strToggleDetails="切换详情"
m_strShowLegend="切换图例"
m_strLegendTitle="图例"
 
m_strSection1="第1页名称图标"
m_strSection2="第1页职业图标"
m_strSection3="第2页名称图标"
m_strSection4="第2页职业图标"
m_StrSection5="其它图标"
m_strSectionR="武器图标"
 
m_strShieldsLabel="盾牌"
m_strPCSLabel="芯片插槽"
m_strSPARKLabel="SPARK"
 
m_strNaturalAptitude="天赋"
 
m_strNaturalAptitudeLabels[0]="平凡"
m_strNaturalAptitudeLabels[1]="优良"
m_strNaturalAptitudeLabels[2]="完美"
m_strNaturalAptitudeLabels[3]="超人"
m_strNaturalAptitudeLabels[4]="超神"
 
m_strSkillPoints="士兵技能点"
 
;===========================================================================
 
[XGLocalisedData_DSL]
 
rifle="步枪"
sniper_rifle="狙击步枪"
cannon="加农炮"
shotgun="霰弹枪"
gauntlet="碎片拳刃"
vektor_rifle="维克托步枪"
bullpup="无托式机枪"
SMG="冲锋枪"
pistol="手枪"
sword="近战武器"
gremlin="小精灵"
grenade_launcher="榴弹发射器"
claymore="阔剑地雷"
claymoreP="阔剑地雷IED"
wristblade="开颅刃"
sidearm="自动手枪"
psiamp="灵能增幅器"
replace_psiamp="灵能碎片"
psiamp_pm="灵魂宝石"
sparkrifle="SPARK步枪"
sparkbit="SPARK Bit"
spark_shield="Spark盾牌"
combatknife="战斗刀"
arcthrower="电弧发射器"
holotargeter="全息瞄准器"
lw_gauntlet="XCOM拳刃"
lwgauntlet="XCOM拳刃"
sawedoffshotgun="短管霰弹枪"
Heavy="重型"
psionicreaper="灵能收割者"
psigatlingrifle="灵能加特林"
empty="空"
chemthrower="化学喷射器"
canister="化合罐"
iri_ordnance_launcher="SPARK炮"
iri_kinetic_strike_module="动能打击"
iri_rocket_launcher="火箭发射器"
iri_disposable_launcher="一次性发射器"
shield="盾牌"
proxrocket="婆罗仙发射器"
proxwristblade="婆罗仙手刃"
proxpalm="手持发爆器"
bioamp="生化能放大器"
stimgun="注射枪"
tanklin="坦克灵"
holocron="全息记录仪"
;来自2031929512 Jedi Class Revised
lightsaber="光剑"
saberstaff="剑杖"
;来自1137913176 Necromancer Class - WOTC
necrostaff="死灵法师法杖" 
;来自2787647090 [WOTC] Iridar's Quantum Mystic Class (April Fools')
MysticStaff="神秘法杖"
;来自1629275833 [WotC] Glaive- Massive melee Weapon(ver.1.5)
glaive="长戟"
